"""Данный модуль отвечает за пиксельный формат реализуемой визуализации.
На входе первого этапа экран pygame. Задача: обработка изображения,
получение координат объектов в пикселях, запись информации о цвете.
Выдача координат объктов, который оказались подвергнуты эффекту
для модуля model. Второй этап: model возвращает новые координаты
цветных пикселей, 2d-editor отображает изменения на экране.
"""

class Pixel:
    """Должен хранить цвет и координату. Является центральным."""
    def __init__():
        pass
    def input1():
        pass
    def input2():
        pass
    def output():
        pass
    

